In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\theam\appdata\local\programs\python\python312\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\theam\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.1.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\theam\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\theam\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\theam\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\theam\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [6]:
data = pd.read_csv('experience_salary_data.csv')

In [8]:
print(data.round())

     year of experience  salary
0                     1   52478
1                    13   76851
2                    13   75624
3                     7   64325
4                    10   70338
..                  ...     ...
495                  19   88683
496                   2   53212
497                  16   81764
498                  16   81100
499                   5   60200

[500 rows x 2 columns]

#### data.round() for getting round of value
### data.head(number of data you want from start) for getting first five data
### data.tail(number for data you want from end) for getting last five data

In [9]:
data.round()

     year of experience  salary
0                     1   52478
1                    13   76851
2                    13   75624
3                     7   64325
4                    10   70338
..                  ...     ...
495                  19   88683
496                   2   53212
497                  16   81764
498                  16   81100
499                   5   60200

[500 rows x 2 columns]

In [10]:
data.head

<bound method NDFrame.head of      year of experience  salary
0                     1   52478
1                    13   76851
2                    13   75624
3                     7   64325
4                    10   70338
..                  ...     ...
495                  19   88683
496                   2   53212
497                  16   81764
498                  16   81100
499                   5   60200

[500 rows x 2 columns]>

In [11]:
data.tail()

     year of experience  salary
495                  19   88683
496                   2   53212
497                  16   81764
498                  16   81100
499                   5   60200

In [12]:
data.sum()

year of experience        5453
salary                35884435
dtype: int64

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   year of experience  500 non-null    int64
 1   salary              500 non-null    int64
dtypes: int64(2)
memory usage: 7.9 KB

In [18]:
data.isna().sum()

year of experience    0
salary                0
dtype: int64

In [19]:
data.describe() # 25% 50% 75% of max value

       year of experience        salary
count          500.000000    500.000000
mean            10.906000  71768.870000
std              5.544244  11082.668751
min              1.000000  52009.000000
25%              6.000000  62671.000000
50%             11.000000  72235.500000
75%             16.000000  81763.250000
max             20.000000  89968.000000

In [13]:
data.mean()

year of experience       10.906
salary                71768.870
dtype: float64

In [15]:
data.median()

year of experience       11.0
salary                72235.5
dtype: float64

In [14]:
data.mode()

   year of experience  salary
0                18.0   66841
1                 NaN   84687

### adding data

In [3]:
d = pd.DataFrame({"name":["Amaan","Ahmy","Himanshu","Majid"],"age":[21,20,30,25],"salary":[23000,10000,150,89000]})

### creating new file

In [4]:
d.to_csv('d1.csv',index=False)

In [5]:
d

       name  age  salary
0     Amaan   21   23000
1      Ahmy   20   10000
2  Himanshu   30     150
3     Majid   25   89000

In [6]:
d['salary'] = pd.to_datetime(d['salary'])
d

       name  age                        salary
0     Amaan   21 1970-01-01 00:00:00.000023000
1      Ahmy   20 1970-01-01 00:00:00.000010000
2  Himanshu   30 1970-01-01 00:00:00.000000150
3     Majid   25 1970-01-01 00:00:00.000089000

### Deleting Values

In [7]:
deleteAge = d.drop(columns=["age"])

In [8]:
deleteAge

       name                        salary
0     Amaan 1970-01-01 00:00:00.000023000
1      Ahmy 1970-01-01 00:00:00.000010000
2  Himanshu 1970-01-01 00:00:00.000000150
3     Majid 1970-01-01 00:00:00.000089000